app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Ruby"], ["room_number", 2]]
---
    def create
         school_class=SchoolClass.create(params.require(:school_class).permit(:title, :room_number))

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ? WHERE "school_classes"."id" = ?  [["room_number", 8], ["id", 1]]
---
    def update
        school_class=SchoolClass.find(params[:id])
        school_class.update(params.require(:school_class).permit(:title, :room_number))