app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "ada"], ["last_name", "white"], ["created_at", "2020-11-25 16:06:12.848588"], ["updated_at", "2020-11-25 16:06:12.848588"]]
---
    def create
        student=Student.create(params.require(:student).permit(:first_name, :last_name))

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Mr.Tripp"], ["updated_at", "2020-11-25 18:39:13.197725"], ["id", 4]]
---
    def update
        student=Student.find(params[:id])
        student.update(params.require(:student).permit(:first_name, :last_name))